In [1]:
 # Python extension for interfacing with SQL and better table formatting with Pandas

# !pip install ipython-sql
# !pip install pandas

Our data for this project is initially in 2 CSV files. Lets investigate how these files look like first.

In [10]:
# Lets just load the extensions that we need to begin a separate cell
import pandas as pd
import sqlite3

In [11]:
# Getting a view of the census csv table
census_df = pd.read_csv('census_data.csv')
print(census_df.head())
print(census_df.info())

   zip_code state_code  pop_total  median_household_income  pct_edu_hs  \
0       601         PR      17800                  11507.0     24.1861
1       602         PR      39716                  15511.0     18.3838
2       603         PR      51565                  16681.0     23.6281
3       606         PR       6320                  11648.0     32.7551
4       610         PR      27976                  17751.0     28.7571

   pct_edu_somecollege_under1yr  pct_edu_somecollege_1plusyrs  \
0                        1.2198                       12.9974
1                        1.0237                        8.3569
2                        1.6381                       10.2082
3                        0.7076                        4.0402
4                        1.3412                        9.2270

   pct_edu_attain_assoc  pct_edu_attain_bach  pct_edu_attain_master  \
0                5.0812              15.5212                 2.3387
1               13.3921              13.9403                 4.5524
2                8.1205              16.3225                 4.8049
3                4.7021               7.9662                 1.1185
4                8.4109              12.3096                 2.4640

   pct_edu_attain_prof  pct_edu_attain_doct  pct_white  pct_black  pct_asian  \
0               0.2271               0.5973     0.1573     0.0000     0.0000
1               0.7551               0.9947     3.8448     0.0554     0.1486
2               0.8177               0.6687     1.2508     0.3607     0.3704
3               0.3424               0.2967     0.1741     0.0000     0.0000
4               0.0624               0.7278     1.4691     0.0536     0.0000

   pct_hispanic  pct_amerindian  pct_nativehawaii  pct_tworaces  pct_otherrace
0       99.7978          0.0449            0.0000        0.0000         0.0000
1       93.4560          0.0000            0.0000        2.4172         0.0781
2       96.8254          0.0000            0.0213        0.9367         0.2347
3       99.8259          0.0000            0.0000        0.0000         0.0000
4       97.9196          0.0000            0.0036        0.4432         0.1108
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33120 entries, 0 to 33119
Data columns (total 20 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   zip_code                      33120 non-null  int64
 1   state_code                    33120 non-null  object
 2   pop_total                     33120 non-null  int64
 3   median_household_income       31112 non-null  float64
 4   pct_edu_hs                    32765 non-null  float64
 5   pct_edu_somecollege_under1yr  32765 non-null  float64
 6   pct_edu_somecollege_1plusyrs  32765 non-null  float64
 7   pct_edu_attain_assoc          32765 non-null  float64
 8   pct_edu_attain_bach           32765 non-null  float64
 9   pct_edu_attain_master         32765 non-null  float64
 10  pct_edu_attain_prof           32765 non-null  float64
 11  pct_edu_attain_doct           32765 non-null  float64
 12  pct_white                     32799 non-null  float64
 13  pct_black                     32799 non-null  float64
 14  pct_asian                     32799 non-null  float64
 15  pct_hispanic                  32799 non-null  float64
 16  pct_amerindian                32799 non-null  float64
 17  pct_nativehawaii              32799 non-null  float64
 18  pct_tworaces                  32799 non-null  float64
 19  pct_otherrace                 32799 non-null  float64
dtypes: float64(17), int64(2), object(1)
memory usage: 5.1+ MB
None

Seems like this table contains information on different areas and some info on the people within them, mainly percentages of education and race. \
The zip_code should be the primary key for this table as well (zip_codes are unique), we will check this after we make our SQL database later however.

In [12]:
# Getting a view of the high school csv table
public_hs_df = pd.read_csv('public_hs_data.csv')
print(public_hs_df.head())
print(public_hs_df.info())

     school_id                school_name        street_address          city  \
0  10000500871       Albertville High Sch      402 E McCord Ave   Albertville
1  10000600878           Douglas High Sch       225 Eagle Drive       Douglas
2  10000600883  Kate D Smith DAR High Sch          6077 Main St         Grant
3  10000601585       Brindlee Mt High Sch   994 Scant City Road  Guntersville
4  10000700251            Hoover High Sch  1000 Buccaneer Drive        Hoover

  state_code  zip_code  locale_code  pct_proficient_math  \
0         AL     35950         32.0            16.999999
1         AL     35964         42.0            12.000000
2         AL     35747         42.0            22.000000
3         AL     35976         41.0            21.999999
4         AL     35244         13.0            39.999998

   pct_proficient_reading  pct_white  pct_black  pct_asian  pct_hispanic  \
0               54.000001    64.9018     2.0495     0.5978       31.4261
1               51.999999    74.2373     1.5254     0.5085       23.0508
2               72.000000    97.0588     0.6303     0.2101        1.6807
3               57.000000    93.5310     1.6173     0.5391        3.7736
4               75.000000    57.5275    28.4803     6.3762        4.5696

   pct_amerindian  pct_nativehawaii  pct_tworaces
0          0.1708            0.0000        0.8540
1          0.6780            0.0000        0.0000
2          0.0000            0.0000        0.4202
3          0.2695            0.0000        0.2695
4          0.0000            0.0708        2.9756
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16623 entries, 0 to 16622
Data columns (total 16 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   school_id               16623 non-null  int64
 1   school_name             16623 non-null  object
 2   street_address          16623 non-null  object
 3   city                    16623 non-null  object
 4   state_code              16623 non-null  object
 5   zip_code                16623 non-null  int64
 6   locale_code             16616 non-null  float64
 7   pct_proficient_math     15773 non-null  float64
 8   pct_proficient_reading  15820 non-null  float64
 9   pct_white               16483 non-null  float64
 10  pct_black               16483 non-null  float64
 11  pct_asian               16483 non-null  float64
 12  pct_hispanic            16483 non-null  float64
 13  pct_amerindian          16483 non-null  float64
 14  pct_nativehawaii        16483 non-null  float64
 15  pct_tworaces            16483 non-null  float64
dtypes: float64(10), int64(2), object(4)
memory usage: 2.0+ MB
None

Seems like this table contains information on the different public high schools including; location information, race percentages, proficiency percentages for math and reading.
One interesting thing to note is that locale code is actually related to the urbanization of the town, not really relating to the school itself directly. This is mentioned in the project instructions which gives the following table:

| locale_text | locale_code (locale_size)         |
|-------------|----------------------------------|
| City        | 11 (Large), 12 (Midsize), 13 (Small) |
| Suburb      | 21 (Large), 22 (Midsize), 23 (Small) |
| Town        | 31 (Fringe), 32 (Distant), 33 (Remote) |
| Rural       | 41 (Fringe), 42 (Distant), 43 (Remote) | \

The school_id should be the primary key of this table as it seems like it will be unique values. The zip_code would then be the foreign key to the previous table assuming we were correct earlier.

In [13]:
# Combining tables and maing SQL database

# Make the SQLite database
conn = sqlite3.connect('education.db')

# Write DataFrames to SQLite tables in the database (don't need the dataframe indexes)
public_hs_df.to_sql('highschool', conn, if_exists='replace', index=False)
census_df.to_sql('census', conn, if_exists='replace', index=False)

# Close the connection
conn.close()

In [1]:
# Necessary in the Jupyter Notebook to load the SQL extension and connect to the database file to use SQL directly, currently using SQLite
# Formatting the SQL query outputs into a better format with Pandas

%load_ext sql
%sql sqlite:///education.db
%config SqlMagic.autopandas=True

Lets now check about our unique columns from earlier to make sure they can correctly be assumed to be the primary/foreign keys.

In [10]:
%%sql
SELECT
    COUNT(zip_code) AS total_values_census,
    COUNT(DISTINCT zip_code) AS unique_values_census
FROM
    census;

 * sqlite:///education.db
Done.

   total_values_census  unique_values_census
0                33120                 33120

In [11]:
%%sql
SELECT
    COUNT(school_id) AS total_values_highschool,
    COUNT(DISTINCT school_id) AS unique_values_highschool
FROM
    highschool;

 * sqlite:///education.db
Done.

   total_values_highschool  unique_values_highschool
0                    16623                     16623

Looks like these columns can work as our keys. We won't be adjusting the tables since SQLite does not directly support this function. We could create a temp table and move around the data but this is unecessary to do.

In [23]:
%%sql
PRAGMA table_info(census);

 * sqlite:///education.db
Done.

    cid                          name     type  notnull dflt_value  pk
0     0                      zip_code  INTEGER        0       None   0
1     1                    state_code     TEXT        0       None   0
2     2                     pop_total  INTEGER        0       None   0
3     3       median_household_income     REAL        0       None   0
4     4                    pct_edu_hs     REAL        0       None   0
5     5  pct_edu_somecollege_under1yr     REAL        0       None   0
6     6  pct_edu_somecollege_1plusyrs     REAL        0       None   0
7     7          pct_edu_attain_assoc     REAL        0       None   0
8     8           pct_edu_attain_bach     REAL        0       None   0
9     9         pct_edu_attain_master     REAL        0       None   0
10   10           pct_edu_attain_prof     REAL        0       None   0
11   11           pct_edu_attain_doct     REAL        0       None   0
12   12                     pct_white     REAL        0       None   0
13   13                     pct_black     REAL        0       None   0
14   14                     pct_asian     REAL        0       None   0
15   15                  pct_hispanic     REAL        0       None   0
16   16                pct_amerindian     REAL        0       None   0
17   17              pct_nativehawaii     REAL        0       None   0
18   18                  pct_tworaces     REAL        0       None   0
19   19                 pct_otherrace     REAL        0       None   0

In [24]:
%%sql
PRAGMA table_info(highschool);

 * sqlite:///education.db
Done.

    cid                    name     type  notnull dflt_value  pk
0     0               school_id  INTEGER        0       None   0
1     1             school_name     TEXT        0       None   0
2     2          street_address     TEXT        0       None   0
3     3                    city     TEXT        0       None   0
4     4              state_code     TEXT        0       None   0
5     5                zip_code  INTEGER        0       None   0
6     6             locale_code     REAL        0       None   0
7     7     pct_proficient_math     REAL        0       None   0
8     8  pct_proficient_reading     REAL        0       None   0
9     9               pct_white     REAL        0       None   0
10   10               pct_black     REAL        0       None   0
11   11               pct_asian     REAL        0       None   0
12   12            pct_hispanic     REAL        0       None   0
13   13          pct_amerindian     REAL        0       None   0
14   14        pct_nativehawaii     REAL        0       None   0
15   15            pct_tworaces     REAL        0       None   0

There is also no reason to change any of the other constraints about the columns as we will likely not be adding to these columns.

1. How many public high schools are in each zip code? in each state?

(There are too many ZIP codes to show them all so calculating the average number of schools per ZIP code will do instead.)

In [9]:
%%sql
WITH zip_school_count AS (
    SELECT zip_code, COUNT(*) AS "SchoolCount"
    FROM highschool
    GROUP BY zip_code
)
SELECT AVG(SchoolCount) AS "Avg School Count Per ZIP"
FROM zip_school_count;

 * sqlite:///education.db
Done.

   Avg School Count Per ZIP
0                  1.242005

We could just use the high school table but we don't know for certain that each zip code has a high school in it. However, we also don't know if it is just that one of the tables got data in certain zip_codes that the other did not get. While originally I assumed that it meant that zip_code absolutely does not have a high school in it, we don't know for certain. Therefore, we will only work within the high school table for this question.

The query below was done with previously assumption that if there is a ZIP code in the census table and not in the high school table then it means that zip_code does not have a high school in it. This assumption is wrong, especially because the inverse could be true, a ZIP code could be in the high school table and not in the census table.

In [17]:
%%sql
WITH zip_school_count AS (
    SELECT census.zip_code AS "ZipCode", COUNT(*) AS "SchoolCount"
    FROM census
    LEFT JOIN highschool ON census.zip_code = highschool.zip_code
    GROUP BY census.zip_code
)
SELECT AVG(SchoolCount) AS "Avg School Count Per ZIP"
FROM zip_school_count;

 * sqlite:///education.db
Done.

   Avg School Count Per ZIP
0                  1.097252

Further proof that the two tables do not cover the exact same areas can be seen based on the state codes. A few state codes have high school data but no census data! Therefore, for this question we can't just assume that the same population was used for both tables' data collection and will stick with just the high school table for the moment.

In [36]:
%%sql
SELECT DISTINCT state_code
FROM highschool
EXCEPT
SELECT DISTINCT state_code
FROM census;

 * sqlite:///education.db
Done.

  state_code
0         BI
1         GU
2         VI

In [38]:
%%sql
SELECT state_code, COUNT(*) AS "SchoolCount"
FROM highschool
GROUP BY state_code

 * sqlite:///education.db
Done.

   state_code  SchoolCount
0          AK           50
1          AL          275
2          AR          271
3          AZ          418
4          BI           18
5          CA         1294
6          CO          283
7          CT          170
8          DC           28
9          DE           28
10         FL          493
11         GA          399
12         GU            6
13         HI           39
14         IA          299
15         ID          113
16         IL          704
17         IN          355
18         KS          308
19         KY          208
20         LA          219
21         MA          292
22         MD          185
23         ME          109
24         MI          597
25         MN          420
26         MO          487
27         MS          199
28         MT          168
29         NC          477
30         ND          164
31         NE          268
32         NH           92
33         NJ          352
34         NM          173
35         NV           96
36         NY          933
37         OH          770
38         OK          461
39         OR          229
40         PA          592
41         PR          160
42         RI           48
43         SC          204
44         SD          162
45         TN          340
46         TX         1199
47         UT          141
48         VA          309
49         VI            4
50         VT           45
51         WA          363
52         WI          440
53         WV          103
54         WY           63

2. The locale_code column in the high school data corresponds to various levels of urbanization as listed below. Use the CASE statement to display the corresponding locale_text and locale_size in your query result.
   | locale_text | locale_code (locale_size)              |
   | ----------- | -------------------------------------- |
   | City        | 11 (Large), 12 (Midsize), 13 (Small)   |
   | Suburb      | 21 (Large), 22 (Midsize), 23 (Small)   |
   | Town        | 31 (Fringe), 32 (Distant), 33 (Remote) |
   | Rural       | 41 (Fringe), 42 (Distant), 43 (Remote) |

Lets just look at how the locale_code looks again

In [12]:
%%sql
SELECT locale_code FROM highschool LIMIT 5;

 * sqlite:///education.db
Done.

   locale_code
0         32.0
1         42.0
2         42.0
3         41.0
4         13.0

In case we need the locale_text and locale_size parameters later, lets make a temp table that includes them.

In [61]:
%%sql
CREATE TEMPORARY TABLE temp_locale AS
    SELECT 
        school_id,
        school_name,
        locale_code,
        CASE
            WHEN locale_code > 10 AND locale_code < 14 THEN 'City'
            WHEN locale_code > 20 AND locale_code < 24 THEN 'Suburb'
            WHEN locale_code > 30 AND locale_code < 34 THEN 'Town'
            WHEN locale_code > 40 AND locale_code < 44 THEN 'Rural'
            ELSE 'Unknown'
        END AS locale_text,
        CASE
            WHEN locale_code = 11 OR locale_code = 21 THEN 'Large'
            WHEN locale_code = 12 OR locale_code = 22 THEN 'Midsize'
            WHEN locale_code = 13 OR locale_code = 23 THEN 'Small'
            WHEN locale_code = 31 OR locale_code = 41 THEN 'Fringe'
            WHEN locale_code = 32 OR locale_code = 42 THEN 'Distant'
            WHEN locale_code = 33 OR locale_code = 43 THEN 'Remote'
            ELSE 'Unknown'
        END AS locale_size
    FROM highschool;

 * sqlite:///education.db
Done.

Empty DataFrame
Columns: []
Index: []

Checking the first few rows in the table to make sure it looks right.

In [62]:
%%sql
SELECT school_id, school_name, locale_code, locale_text, locale_size 
FROM temp_locale
ORDER BY school_name 
LIMIT 5;

 * sqlite:///education.db
Done.

,school_id,school_name,locale_code,locale_text,locale_size
0,251251002790,21st Century Skills Academy,21.0,Suburb,Large
1,270002504190,287 OLL ACADEMIC,13.0,City,Small
2,480735000001,A & M CONS H S,13.0,City,Small
3,170654000339,A B Shepard High Sch (Campus),21.0,Suburb,Large
4,480972000442,A C JONES H S,32.0,Town,Distant

Lets now take a look at the number of schools for each different value of the locale information and what the locale text and sizes would be for each.

In [66]:
%%sql
SELECT locale_code, locale_text, locale_size, COUNT(*)
FROM temp_locale
GROUP BY locale_code;

 * sqlite:///education.db
Done.

    locale_code locale_text locale_size  COUNT(*)
0           NaN     Unknown     Unknown         7
1          11.0        City       Large      2024
2          12.0        City     Midsize       745
3          13.0        City       Small       879
4          21.0      Suburb       Large      3554
5          22.0      Suburb     Midsize       464
6          23.0      Suburb       Small       311
7          31.0        Town      Fringe       549
8          32.0        Town     Distant      1219
9          33.0        Town      Remote       764
10         41.0       Rural      Fringe      2004
11         42.0       Rural     Distant      2349
12         43.0       Rural      Remote      1754

Some seems to not have an actualy locale_code but we'll keep these in our dataset for now.